{
    "title": "Malaysia's Johor eyes Shenzhen-style hub with Singapore, report says - The Japan Times",
    "datetime": "Mon, 13 May 2024 06:21:00 GMT",
    "description": "Malaysia's Johor eyes Shenzhen-style hub with Singapore, report says  The Japan Times",
    "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LmphcGFudGltZXMuY28uanAvYnVzaW5lc3MvMjAyNC8wNS8xMy9tYWxheXNpYS1zaGVuemhlbi1odWItc2luZ2Fwb3JlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
    "context": "Malaysia’s Johor state is proposing its economic and petrochemical hubs as the sites for a special zone with neighbor Singapore, as it aims to become the \"Shenzhen of Southeast Asia,\" according to a report in the Star.\n\nThe suggested area will comprise Iskandar Malaysia and Pengerang on the east coast of the state, Johor Menteri Besar Onn Hafiz Ghazi was cited as saying at the state assembly on Sunday. If approved, the Johor-Singapore Special Economic Zone would be nearly twice the size of China’s Shenzhen at 3,505 square kilometers.\n\nBoth countries had agreed in January to set up the zone, and Malaysia plans to finalize and sign a pact by the end of year, according to Onn Hafiz. Official engagements with Singapore on the economic zone is expected to begin in June, he added.\n\nThe special economic zone could turn Johor into Southeast Asia’s Shenzhen, the report cited Onn Hafiz as saying, noting the similarities between the geographical makeup of the regions. Johor is also proposing 16 economic sectors as part of the zone, including electrical and electronics, manufacturing, healthcare and tourism, he said.\n\nIskandar Malaysia is a 2,217 square kilometer economic corridor established in 2006 which covers most of Johor’s strategic infrastructure and real estate projects. That includes the Johor Bahru city center and Country Garden’s struggling $100 billion megacity Forest City.\n\nPengerang is home to the Pengerang Integrated Petroleum Complex, a major petrochemical facility that includes the Pengerang Energy Complex being developed by Singapore’s ChemOne Holdings.",
    "authors": [
        "Ram Anand",
        "Anuradha Raghu",
        "Ram Anand Anuradha Raghu"
    ],
    "publisher_href": "https://www.japantimes.co.jp"
}