{
    "title": "Singapore diplomat accused of filming naked boy at Tokyo bathhouse - South China Morning Post",
    "datetime": "Thu, 02 May 2024 08:01:58 GMT",
    "description": "Singapore diplomat accused of filming naked boy at Tokyo bathhouse  South China Morning Post",
    "url": "https://news.google.com/rss/articles/CBMinQFodHRwczovL3d3dy5zY21wLmNvbS9uZXdzL2FzaWEvc291dGhlYXN0LWFzaWEvYXJ0aWNsZS8zMjYxMTc4L2phcGFuLXBvbGljZS1pbnZlc3RpZ2F0ZS1zaW5nYXBvcmUtZGlwbG9tYXQtYWxsZWdlZGx5LWZpbG1pbmctbmFrZWQtc2Nob29sYm95LXRva3lvLXB1YmxpYy1iYXRo0gGdAWh0dHBzOi8vYW1wLnNjbXAuY29tL25ld3MvYXNpYS9zb3V0aGVhc3QtYXNpYS9hcnRpY2xlLzMyNjExNzgvamFwYW4tcG9saWNlLWludmVzdGlnYXRlLXNpbmdhcG9yZS1kaXBsb21hdC1hbGxlZ2VkbHktZmlsbWluZy1uYWtlZC1zY2hvb2xib3ktdG9reW8tcHVibGljLWJhdGg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
    "context": "The Yomiuri newspaper reported that on February 27, the man used his smartphone to secretly film a 13-year-old secondary school student in the changing room of a public bath. The boy was naked.\n\nThe diplomat in question is a 55-year-old, who is a “former” counsellor at the embassy, according to NHK. A counsellor is a diplomatic rank for officers serving overseas, such as in an embassy.\n\nA diplomat at the Singapore embassy in Tokyo was questioned by police after being suspected of filming a male teenager at a public bath, according to Japanese media reports on Thursday.\n\nStaff members at the public bath in Tokyo’s Minato ward reportedly called the police who, upon arriving, searched the diplomat’s phone and found “multiple naked photos of male customers”, according to the Asahi newspaper.\n\nIt added that the diplomat refused to go to the police station but told officers he had taken such photos in other public baths.\n\nWhen asked to delete the photos from his phone, the diplomat “deleted them on the spot”, reported the Japanese news outlet. He allegedly deleted 700 photos from his phone, which he told police he had taken in the six months leading up to the incident.\n\nThe Tokyo police are investigating potential violations of child pornography laws and are planning to ask Singapore’s Ministry of Foreign Affairs (MFA) to have the man turn himself in, said Asahi. Formal charges are also being considered.\n\nThe diplomat has been dismissed as a counsellor but is immune to arrest in accordance with the Vienna Convention on Diplomatic Relations, which states that diplomats cannot be arrested or detained in a country they have been dispatched to.\n\nWhen asked by the Asahi newspaper on Thursday, the embassy was reportedly unaware of the public bath incident. The embassy also told the paper the diplomat had “completed his assignment as of April 12” and has returned to Singapore.\n\nCNA has reached out to MFA for comment.\n\nAdditional reporting by Kyodo",
    "authors": "Unknown Author",
    "publisher_href": "https://www.scmp.com"
}