{
    "title": "Wall Street Journal cuts Hong Kong staff, shifts focus to Singapore - Al Jazeera English",
    "datetime": "Fri, 03 May 2024 05:45:22 GMT",
    "description": "Wall Street Journal cuts Hong Kong staff, shifts focus to Singapore  Al Jazeera English",
    "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmFsamF6ZWVyYS5jb20vZWNvbm9teS8yMDI0LzUvMy93YWxsLXN0cmVldC1qb3VybmFsLWN1dHMtaG9uZy1rb25nLXN0YWZmLXNoaWZ0cy1mb2N1cy10by1zaW5nYXBvcmXSAXFodHRwczovL3d3dy5hbGphemVlcmEuY29tL2FtcC9lY29ub215LzIwMjQvNS8zL3dhbGwtc3RyZWV0LWpvdXJuYWwtY3V0cy1ob25nLWtvbmctc3RhZmYtc2hpZnRzLWZvY3VzLXRvLXNpbmdhcG9yZQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
    "context": "Company-wide memo says the newspaper is shifting its ‘center of gravity in the region’ to Southeast Asian hub.\n\nHong Kong, China – The Wall Street Journal has announced staff cuts at its Hong Kong bureau as it shifts its “center of gravity in the region” to Singapore, marking the latest blow to the financial hub’s once-thriving media industry.\n\nEditor-in-chief Emma Tucker told staff in a company-wide memo on Thursday that the newspaper was following the same path that “many of the companies we cover have done”.\n\nThe cuts include six editorial staff in Hong Kong and two reporters at the newspaper’s Singapore office, two sources familiar with the matter told Al Jazeera on condition of anonymity.\n\nIn her memo, Tucker said “some of our colleagues, mostly in Hong Kong, will be leaving us”, while listing several new positions in Singapore, including an editor and several reporters.\n\n“At the core of these changes is the creation of a new business, finance and economics group,” she said.\n\n“This unites what had been separate teams under one banner with a common goal: Focus on the biggest money stories in Asia – the rise of China’s EV industry, the chip war, China Shock 2.0, the struggles of Hong Kong’s finance industry and China’s stunning property bust.”\n\nThe WSJ did not immediately respond to a request for comment.\n\nSince the imposition of a Beijing-decreed national security law and some of the world’s toughest pandemic curbs in 2020, numerous international companies have departed Hong Kong or scaled bank operations in the city, shifting resources elsewhere.\n\nChina’s economic slowdown has also impacted the work of the army of analysts and financiers who thrived in Hong Kong’s once-free-wheeling atmosphere, in turn informing the coverage of media outlets such as the WSJ.\n\nEarlier this year, Hong Kong’s Hang Seng Index fell to its lowest levels since 1997, the year the former British colony was returned to Chinese sovereignty, in what was widely seen as an ominous sign for the future of the city’s economy – although the market has rebounded over 10 percent during the last month.\n\nHundreds of thousands of expatriate and local residents have departed the city in recent years, many of them driven to leave by harsh zero-COVID curbs and a national security crackdown that has weakened rights and freedoms that are supposed to be guaranteed until 2047 under an arrangement known as “one country, two systems”.\n\nMainland Chinese and Hong Kong officials have argued that a greater focus on national security has been necessary to restore peace and stability to the city after mass antigovernment protests in 2019 that devolved into widespread property destruction and clashes with police.\n\nSeveral local independent news outlets have shuttered under political pressure, while international media including The New York Times and Radio Free Asia have shifted editorial positions to cities such as Seoul and Taipei.\n\nOnce known as one of the freest media environments in Asia, Hong Kong ranks 135 out of 180 countries and territories in Reporters without Borders’ (RSF) latest media freedom index released on Friday, falling between the Philippines and South Sudan.\n\nLast month, Hong Kong immigration authorities denied entry to an RSF representative who visited the city to attend the ongoing national security trial of media tycoon Jimmy Lai.",
    "authors": [
        "Erin Hale"
    ],
    "publisher_href": "https://www.aljazeera.com"
}