{
    "title": "Top US Treasury official to travel to Singapore, Malaysia to discuss sanctions - Yahoo! Voices",
    "datetime": "Fri, 03 May 2024 10:06:00 GMT",
    "description": "Top US Treasury official to travel to Singapore, Malaysia to discuss sanctions  Yahoo! Voices",
    "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3LnlhaG9vLmNvbS9uZXdzL3RvcC11cy10cmVhc3VyeS1vZmZpY2lhbC10cmF2ZWwtMTAwNjAwOTk5Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
    "context": "By Daphne Psaledakis\n\nWASHINGTON (Reuters) - The U.S. Treasury Department's top sanctions official will travel to Singapore and Malaysia next week, a source familiar with the matter told Reuters, as Washington seeks to combat funding for Iran and its proxy groups as well as evasion of its sanctions on Russia.\n\nThe source, speaking on condition of anonymity, said there has been an uptick in money moving to Iran and its proxies, including Hamas, through the Malaysian financial system.\n\nDuring the visit, first reported by Reuters, Treasury's under secretary for terrorism and financial intelligence, Brian Nelson, is expected to discuss U.S. concerns and the sanctions risk such activity poses, the source said. Treasury's general counsel, Neil MacBride, will also be on the trip.\n\nThe visit comes as Treasury has increased its focus on terrorist financing through Southeast Asia, including through fundraising efforts and illicit Iranian oil sales, the source said.\n\nThe Treasury Department in December imposed sanctions on four Malaysia-based companies it accused of being fronts supporting Iran's production of drones.\n\nWashington has recently imposed further sanctions targeting Iran, including over Iranian drones used by Russian in the war in Ukraine, as the U.S. has sought to ratchet up pressure on Tehran after its attack on Israel.\n\nWhile in Singapore, Nelson will discuss the enforcement of a G7-led price cap on Russian oil as well as cutting off the transshipment of critical dual-use goods, those which have both civilian and military purposes, said the source.\n\nThe United States and its allies have imposed sanctions on thousands of targets since Russia invaded neighboring Ukraine. The war has seen tens of thousands killed and cities destroyed.\n\nWashington has since sought to crack down on evasion of the Western measures, including the shipment of dual-use goods through third countries to Russia.\n\nSingapore is a major shipping hub. Insurance and other maritime service providers operating in Singapore have warned of evasion of the price cap on Russian oil, complaining that it is difficult to confirm that paperwork promising oil is bought at or below the $60 cap is accurate.\n\nThe G7 price cap on Russian crude oil, imposed in December 2022, aims to reduce Russia's revenues available for its war in Ukraine by allowing Western-supplied insurance and other services only on cargoes priced below $60 a barrel.\n\n(Reporting by Daphne Psaledakis; Additional reporting by Timothy Gardner; Editing by Don Durfee and Leslie Adler)",
    "authors": [
        "Daphne Psaledakis"
    ],
    "publisher_href": "https://www.yahoo.com"
}